In [1]:
import pandas as pd
import numpy as np
pathname='/Users/rishigummakonda/Documents/Springboard/capstone/data/census_tract/from_atlas/'
nyc = pd.read_csv(pathname+'nyc_tracts.csv')
la = pd.read_csv(pathname+'la_tracts.csv')
den = pd.read_csv(pathname+'denver_tracts.csv')
nash=pd.read_csv(pathname+'nashville_tracts.csv')

In [66]:
def split_codes(full_codes):
    state_codes=[]
    county_codes=[]
    tract_codes=[]
    for code in full_codes:
        code=str(code)
        state=int(code[:2])
        county=int(code[2:5])
        tract=int(code[5:11])
        state_codes.append(state)
        county_codes.append(county)
        tract_codes.append(tract)
    dict_codes = {'full_codes': full_codes, 'state':state_codes, 'county': county_codes, 'tract': tract_codes}
    df= pd.DataFrame(dict_codes)
    return df

In [67]:
nyc_names =nyc["Name"]
new_nyc = nyc[nyc_names.str.contains("New York") | nyc_names.str.contains("Queens") | nyc_names.str.contains("Bronx County")| nyc_names.str.contains("Richmond")| nyc_names.str.contains("Kings")]
nyc_codes = list(new_nyc['tract'])

In [68]:
nyc_tracts=split_codes(nyc_codes)

In [69]:
nyc_tracts

       full_codes  state  county   tract
0     36047004400     36      47    4400
1     36061012800     36      61   12800
2     36047061200     36      47   61200
3     36059300100     36      59  300100
4     36081091601     36      81   91601
...           ...    ...     ...     ...
2153  36047040700     36      47   40700
2154  36047118000     36      47  118000
2155  36081061302     36      81   61302
2156  36005024900     36       5   24900
2157  36081022900     36      81   22900

[2158 rows x 4 columns]

In [70]:
la_names =la["Name"]
new_la = la[la_names.str.contains("Los Angeles")]
la_codes = list(new_la['tract'])
la_tracts=split_codes(la_codes)
la_tracts

      full_codes  state  county  tract
0     6037262301     60     372  62301
1     6037265100     60     372  65100
2     6037262302     60     372  62302
3     6037265420     60     372  65420
4     6037139801     60     371  39801
...          ...    ...     ...    ...
1041  6037980028     60     379  80028
1042  6037265304     60     372  65304
1043  6037222700     60     372  22700
1044  6037980009     60     379  80009
1045  6037980022     60     379  80022

[1046 rows x 4 columns]

In [71]:
den_names =den["Name"]
new_den = den[den_names.str.contains("Denver")]
denver_codes=list(new_den['tract'])
denver_tracts=split_codes(denver_codes)
denver_tracts

     full_codes  state  county  tract
0    8031003203     80     310   3203
1    8031004303     80     310   4303
2    8031003901     80     310   3901
3    8031006804     80     310   6804
4    8005015100     80      50  15100
..          ...    ...     ...    ...
163  8031980000     80     319  80000
164  8059980000     80     599  80000
165  8031001902     80     310   1902
166  8031004107     80     310   4107
167  8031980100     80     319  80100

[168 rows x 4 columns]

In [72]:
nash_names =nash["Name"]
new_nash = nash[nash_names.str.contains("Nashville")]
nashville_codes=list(new_nash['tract'])
nashville_tracts=split_codes(nashville_codes)
nashville_tracts

      full_codes  state  county   tract
0    47037018601     47      37   18601
1    47037018500     47      37   18500
2    47037018700     47      37   18700
3    47037017901     47      37   17901
4    47037017902     47      37   17902
..           ...    ...     ...     ...
149  47037013602     47      37   13602
150  47037014800     47      37   14800
151  47037980100     47      37  980100
152  47037013000     47      37   13000
153  47037980200     47      37  980200

[154 rows x 4 columns]

In [73]:
all_tracts_df = pd.concat([nyc_tracts,la_tracts,denver_tracts,nashville_tracts], ignore_index=True)

In [74]:
all_tracts_df

       full_codes  state  county   tract
0     36047004400     36      47    4400
1     36061012800     36      61   12800
2     36047061200     36      47   61200
3     36059300100     36      59  300100
4     36081091601     36      81   91601
...           ...    ...     ...     ...
3521  47037013602     47      37   13602
3522  47037014800     47      37   14800
3523  47037980100     47      37  980100
3524  47037013000     47      37   13000
3525  47037980200     47      37  980200

[3526 rows x 4 columns]

In [75]:
#import atlas.csv
atlas = pd.read_csv('/Users/rishigummakonda/Documents/Springboard/capstone/data/atlas_data/atlas.csv')

In [76]:
atlas.head()

,tract,county,state,cz,czname,hhinc_mean2000,mean_commutetime2000,frac_coll_plus2010,frac_coll_plus2000,foreign_share2010,...,kfr_white_p25,kfr_white_p75,kfr_white_p100,count_pooled,count_white,count_black,count_asian,count_hisp,count_natam,mergecounts
0,20100,1,1,11101.0,Montgomery,68638.727,26.171911,0.254428,0.156479,0.009950,...,30327.947,50820.145,75126.031,519.0,457.0,42.0,3.0,4.0,6.0,matched (3)
1,20200,1,1,11101.0,Montgomery,57242.512,24.806705,0.267194,0.146932,0.016337,...,42188.813,54239.121,66645.695,530.0,173.0,336.0,1.0,5.0,1.0,matched (3)
2,20300,1,1,11101.0,Montgomery,75647.727,25.322525,0.164159,0.224413,0.027096,...,33670.453,51579.383,71990.969,960.0,774.0,151.0,1.0,21.0,2.0,matched (3)
3,20400,1,1,11101.0,Montgomery,74852.055,22.965347,0.252744,0.230469,0.015083,...,34181.051,52847.863,74330.250,1123.0,1033.0,40.0,6.0,37.0,0.0,matched (3)
4,20500,1,1,11101.0,Montgomery,96174.766,26.222353,0.375063,0.321154,0.046488,...,39540.148,58699.035,80415.094,1867.0,1626.0,137.0,13.0,39.0,8.0,matched (3)

In [77]:
state_f= atlas[atlas['state']== 34]
county_f = state_f[state_f['county']== 13]
tract= county_f[county_f['tract'] == 21000]
tract

,tract,county,state,cz,czname,hhinc_mean2000,mean_commutetime2000,frac_coll_plus2010,frac_coll_plus2000,foreign_share2010,...,kfr_white_p25,kfr_white_p75,kfr_white_p100,count_pooled,count_white,count_black,count_asian,count_hisp,count_natam,mergecounts
41118,21000,13,34,19600.0,Newark,131808.14,29.452864,0.461251,0.473662,0.153814,...,57149.566,68778.805,80010.008,1095.0,1000.0,4.0,28.0,39.0,0.0,matched (3)

In [78]:
def filter_atlas(city_df):
    list_of_tracts=[]
    for index, row in city_df.iterrows():
        state_f = atlas[atlas['state'] == row['state']]
        county_f = state_f[state_f['county'] == row['county']]
        tract = county_f[county_f['tract'] == row['tract']] 
        list_of_tracts.append(tract)
    df = pd.concat(list_of_tracts,ignore_index=True)
    return df

In [79]:
nyc_atlas = filter_atlas(nyc_tracts)
nyc_atlas.head()

,tract,county,state,cz,czname,hhinc_mean2000,mean_commutetime2000,frac_coll_plus2010,frac_coll_plus2000,foreign_share2010,...,kfr_white_p25,kfr_white_p75,kfr_white_p100,count_pooled,count_white,count_black,count_asian,count_hisp,count_natam,mergecounts
0,4400,47,36,19400.0,New York,152899.50,43.957073,0.466812,0.475013,0.241550,...,76943.727,89098.938,101479.660,533.0,451.0,2.0,44.0,23.0,1.0,matched (3)
1,12800,61,36,19400.0,New York,218632.00,27.595802,0.874032,0.776530,0.146937,...,37659.164,64301.359,98215.914,1058.0,965.0,6.0,27.0,25.0,0.0,matched (3)
2,61200,47,36,19400.0,New York,129720.98,39.906467,0.684685,0.497763,0.488393,...,66186.242,86742.633,110935.950,241.0,230.0,0.0,4.0,7.0,0.0,matched (3)
3,300100,59,36,19400.0,New York,256467.44,46.023239,0.594739,0.628734,0.326699,...,59012.855,74432.352,90077.969,1226.0,1162.0,1.0,30.0,9.0,0.0,matched (3)
4,91601,81,36,19400.0,New York,104978.23,47.702164,0.472294,0.328169,0.016456,...,56034.027,76800.070,99922.594,847.0,831.0,1.0,2.0,13.0,0.0,matched (3)

In [82]:
from sklearn.model_selection import train_test_split

0       65049.199
1       36134.207
2       59156.551
3       57876.207
4       55170.234
          ...
2143          NaN
2144          NaN
2145          NaN
2146          NaN
2147          NaN
Name: kfr_pooled_p25, Length: 2148, dtype: float64